Documents/Д_ЗаявкаНаСогласованиеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Д_ЗаявкаНаСогласованиеДоговора</Name>
			<BasedOn>
				<xr:Item>Catalog.сабШаблоныДоговоров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текстовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицоКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьТаблицу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчетПремии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сабШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рецензенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепленныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВремХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПрикрепленныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Операция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецИмяТЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецСтрокаТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПрикрепленныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыПрикрепленныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОказанияУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяИнформация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СогласованиеОбщее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>СогласованиеОбщее</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСогласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Д_ЗаявкаНаСогласованиеДоговора/Forms/ФормаДокумента/Ext/Form/Module.bsl
///////////////////////////////////общие процедуры и функции
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//если уже есть БП по документу, то не отражаем кнопки запуска БП
	
	
	//Если НЕ ТекБП = Неопределено Тогда
	//	ТекДоступность = ТекБПСтруРекв.ОснованиеЗаблокирован;
	//	Если ТекДоступность = Неопределено Тогда
	//		ТекДоступность = ТекБПСтруРекв.Стартован;
	//	КонецЕсли;
	//	БюджетныйНаКлиенте.ФормаТолькоПросмотр(Объект, ЭтаФорма, ТекДоступность И НЕ ВозможностьРедактированияИзАвтомаршрута);
	//	Элементы.ФормаДокументСогласовать.Заголовок = "Отправить и закрыть";
	//	Если ЗначениеЗаполнено(ТекБП) Тогда
	//		Элементы.ДобавитьКому.Доступность = 1 - ТекДоступность;
	//		Элементы.ФормаДокументСогласовать.Доступность = 1 - ТекДоступность;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Элементы.ВидимостьВсем.Подсказка = "Документ будет отражаться в списке у всех пользователей, которым доступно предприятие.";
	//Элементы.ВидимостьВсем.Заголовок = "Доступен пользователям предприятиия: " + Строка(Объект.Предприятие);
	ПредприятиеПриИзменении(Неопределено);

	//Если Не РежимВосстановления Тогда
	//	ЭтаФорма.ПодключитьОбработчикОжидания("АвтосохранениеРеквизитовФормыНаКлиенте", 30);
	//КонецЕсли;	
	
	//формируем красивые списки
	ДоступныеПредприятия = БюджетныйНаСервере.ПолучитьПредприятия();
	Если ДоступныеПредприятия.Количество() < 15 Тогда
		БюджетныйНаКлиенте.ЗаполнитьСписокРеквизитаДубль2(ЭтаФорма, "СписокВыбора_Предприятие", ДоступныеПредприятия, Объект.Предприятие);
	КонецЕсли;
	
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВидСЗ.СписокВыбора.Добавить(Справочники.Д_ВидыВнутреннихДокументов.ПолучитьЭлементПредопределенный("ЗаявкаНаСогласованиеДоговора"));
	
	Если Объект.Ссылка.Пустая() Тогда
		Если ПустаяСтрока(Объект.Кому) Тогда
			Объект.Кому = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Элементы.ОтслеживатьЗаявку.Пометка = БПСервер.ПроверитьОтслеживаниеЗаявки(Объект.Ссылка, ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	
	сабОбщегоНазначения.ОбновитьКоличествоПрикрепленныхФайловСервер(ЭтаФорма);
	Если Параметры.Свойство("РежимВосстановления") и Параметры.РежимВосстановления Тогда
		сабОбщегоНазначения.ВосстановлениеРеквизитовФормы(ЭтаФорма);
		РежимВосстановления = Истина;
	Иначе 
		РежимВосстановления = Ложь;
	КонецЕсли;
		
	БюджетныйНаСервере.ДействияПриСозданииФормыДокумента(ЭтаФорма, Ложь);
	
	Период.ДатаНачала = Объект.ДатаДоговора;
	Период.ДатаОкончания = Объект.ДатаОкончания;
	
	Если Параметры.Свойство("ВидСЗ") Тогда
		Объект.ВидСЗ = Параметры.ВидСЗ;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьПодчиненныйДоговор();
		СтатусТочкаМаршрута = БПСервер.ПолучитьТекущуюТочкуМаршрута(Объект.Ссылка);
		БПСервер.ДобавитьКомандыПроцессов(ЭтаФорма, "Группа", Объект.Ссылка);
	Иначе
		Элементы.ДоговорПодчиненный.Видимость = Ложь;
		Элементы.ПрикрепленныеОригиналы.Видимость = Ложь;
		СтатусТочкаМаршрута = "На подготовке";
	КонецЕсли;
	
	ПроверитьСтатьиДДСДляОтбора();
	
	ВидДоговораПриИзмененииНаСервере();
	
   УстановитьДоступностьФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормы()
	
	ВозможностьРедактированияИзАвтомаршрута = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекБП = БПСервер.НайтиТекущийБПСервер(Объект.Ссылка);
		Если НЕ ТекБП = Неопределено Тогда
			ТекБПСтруРекв = БюджетныйНаСервере.ВернутьРеквизиты(ТекБП, "ОснованиеЗаблокирован, Стартован, ОтправлятьВсем");
			ВозможностьРедактированияИзАвтомаршрута = БПСервер.ТекПользовательИсполнительДокумента(Объект.Ссылка, Истина);
		КонецЕсли;
	Иначе
		ТекБП = Неопределено;
		ТекБПСтруРекв = Новый Структура;
		ВсемСразу = Неопределено;
	КонецЕсли;
	
	ЕстьБП = Ложь;
	ТекБПСтруРекв = Новый Структура("ОснованиеЗаблокирован, Стартован", Ложь, Ложь); 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекБП = БПСервер.НайтиТекущийБПСервер(Объект.Ссылка);
		Если НЕ ТекБП = Неопределено И ТипЗнч(ТекБП) = Тип("СправочникСсылка.СогласованиеОбщее") Тогда
			ТекБПСтруРекв = БюджетныйНаСервере.ВернутьРеквизиты(ТекБП, "ОснованиеЗаблокирован, Стартован");
			ВсемСразу = Неопределено;
			ЕстьБП = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТекДоступность = Ложь;
	Если НЕ ТекБП = Неопределено Тогда
		ТекДоступность = ТекБПСтруРекв.ОснованиеЗаблокирован;
		Если ТекДоступность = Неопределено Тогда
			ТекДоступность = ТекБПСтруРекв.Стартован;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Ссылка) И ПараметрыСеанса.ДоступныеПредприятия.Найти(Объект.Предприятие) = Неопределено И ПараметрыСеанса.ДоступныеПользователи.Найти(Объект.Автор) = Неопределено Тогда //недоступное предприятие
			ТекДоступность = Истина;		
		КонецЕсли;
		
		БюджетныйНаСервере.ФормаТолькоПросмотр(Объект, ЭтаФорма, ТекДоступность);
	КонецЕсли;
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьБизнесПроцессы", Истина);
	Если ЗначениеЗаполнено(ТекЭл) И ТекЭл.Значение Тогда
		Если Не Элементы.Найти("ФормаДокументСогласовать") = Неопределено Тогда
			Элементы.ФормаДокументСогласовать.Видимость = Не ЕстьБП;
			Элементы.ФормаДокументСогласовать.КнопкаПоУмолчанию = Не ЕстьБП;
		КонецЕсли;
		Элементы.ФормаПровестиИЗакрыть.Видимость = Ложь;
		Элементы.СтатусТочкаМаршрута.Видимость = Истина;
	Иначе
		Если Не Элементы.Найти("ФормаДокументСогласовать") = Неопределено Тогда
			Элементы.ФормаДокументСогласовать.Видимость = Ложь;
		КонецЕсли;
		Элементы.СтатусТочкаМаршрута.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ФормаЗаписатьИЗакрыть.Видимость = ЕстьБП;
	Элементы.ФормаЗаписатьИЗакрыть.КнопкаПоУмолчанию = ЕстьБП;

	//ВозможностьРазрешитьРедактирование(ТекБП, ТекДоступность);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатьиДДСДляОтбора()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	//|ГДЕ
	//|	СтатьиДвиженияДенежныхСредств.ИспользуетсяВДоговорах = ИСТИНА";
	//
	////Запрос.УстановитьПараметр("", );
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//ЕстьСтатьиДляДоговоров = Выборка.Количество() > 0;
	
	ЕстьСтатьиДляДоговоров = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = 1 - ПроверитьЗаполнение();
	сабОбщегоНазначения.ОчиститьАвтосохраненияОбъекта(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныйДоговор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрикрепленныеОбъекты.Объект) КАК Количество
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеОбъекты КАК ПрикрепленныеОбъекты
	               |		ПО ДоговорыКонтрагентов.Ссылка = ПрикрепленныеОбъекты.Владелец
	               |			И (ПрикрепленныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Перечисление.ВидыПрикрепленныхОбъектов.Договор))
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ДокументОснование = &ДокументОснование
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоговорыКонтрагентов.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоговорПодчиненный = Выборка.Ссылка;
		Если Выборка.Количество Тогда
			ПрикрепленныеОригиналы = "Объекты (" + Строка(Выборка.Количество) + ")";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКому(Команда)
	Если НЕ Объект.Рецензенты.Количество() И НЕ ПустаяСтрока(Объект.Кому) И ТипЗнч(Объект.Кому) = Тип("СправочникСсылка.Пользователи") Тогда
		НоваяСтрока = Объект.Рецензенты.Добавить();
		НоваяСтрока.Пользователь = Объект.Кому;
	КонецЕсли;
	
	ТекПользователь = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора");
	Если НЕ ТекПользователь = Неопределено Тогда
		
		НетВБазе = БюджетныйНаСервере.ВернутьРеквизит(ТекПользователь, "НеУчаствуетВДокументообороте");
		Если НетВБазе Тогда
			Если Вопрос("Пользователь " + Строка(ТекПользователь) + " не участвует в документообороте, т.к. не имеет доступа к базе. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат;	
			КонецЕсли;	
		КонецЕсли;	
		
		НоваяСтрока = Объект.Рецензенты.Добавить();
		НоваяСтрока.Пользователь = ТекПользователь;
	Иначе
		Возврат;
	КонецЕсли;
	СформироватьКому(ТекПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомуПриИзменении(Элемент)
	//Проверяем пользователей по наименованию. разделитель ;
	Если ТипЗнч(Объект.Кому) = Тип("Строка") И НЕ ПустаяСтрока(Объект.Кому) Тогда
		ТекСтрока = СтрЗаменить(Объект.Кому, "; ", ";");
		МассивИмен = Новый Массив;
		ТекИмя = "";
		Для ТекСимвол = 1 По СтрДлина(ТекСтрока) Цикл
			
			Если Сред(ТекСтрока, ТекСимвол, 1) = ";" Тогда
				МассивИмен.Добавить(ТекИмя);
				ТекИмя = "";
			Иначе
				ТекИмя = ТекИмя + Сред(ТекСтрока, ТекСимвол, 1);			
			КонецЕсли;	
			
		КонецЦикла;
		МассивИмен.Добавить(ТекИмя);
		Для каждого ТекИмя Из МассивИмен Цикл	
			Если НайтиИмя(ТекИмя) = Неопределено Тогда
				Предупреждение("Пользователь " + Строка(ТекИмя) + " не найден в справочнике.");
				СформироватьКому();
				Возврат;
			КонецЕсли;		
		КонецЦикла;
		СформироватьТЧ(МассивИмен);
	Иначе
		НетВБазе = БюджетныйНаСервере.ВернутьРеквизит(Объект.Кому, "НеУчаствуетВДокументообороте");
		Если НетВБазе Тогда
			Если Вопрос("Пользователь " + Строка(Объект.Кому) + " не участвует в документообороте, т.к. не имеет доступа к базе. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Объект.Кому = ПользовательПустаяСсылка();
				Возврат;	
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКому(ТекПользователь = Неопределено)
	
	//Если Объект.Рецензенты.Количество() > 1 Тогда
	//	СтрокаКому = "";
	//	Для каждого ТекРецензент Из Объект.Рецензенты Цикл
	//		СтрокаКому = СтрокаКому + Строка(ТекРецензент.Пользователь) + "; ";		
	//	КонецЦикла;
	//	СтрокаКому = Лев(СтрокаКому, СтрДлина(СтрокаКому) - 2);
	//	Объект.Кому = СтрокаКому;
	//Иначе
	//	Если НЕ ТекПользователь = Неопределено Тогда
	//		Объект.Кому = ТекПользователь;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Элементы.ДобавитьКому.Видимость Тогда
		СтрокаКому = "";
		Для каждого ТекРецензент Из Объект.Рецензенты Цикл
			СтрокаКому = СтрокаКому + Строка(ТекРецензент.Пользователь) + "; ";		
		КонецЦикла;
		СтрокаКому = Лев(СтрокаКому, СтрДлина(СтрокаКому) - 2);
		Объект.Кому = СтрокаКому;
	Иначе
		Объект.Кому = ТекПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТЧ(МассивИмен)
	Объект.Рецензенты.Очистить();
	Для каждого ТекПользователь Из МассивИмен Цикл
		НоваяСтрока = Объект.Рецензенты.Добавить();
		НоваяСтрока.Пользователь = НайтиИмя(ТекПользователь);	
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиИмя(ТекИмя)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекИмя);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции // ()

&НаКлиенте
Процедура КомуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Кому = "" И Элементы.ДобавитьКому.Видимость = Ложь Тогда
		Объект.Кому = ПользовательПустаяСсылка();
	КонецЕсли;	
		
	Если ТипЗнч(Объект.Кому) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		МассивСтарыхРецензентов = Новый Массив;
		Для каждого ТекРецензент Из Объект.Рецензенты Цикл
			МассивСтарыхРецензентов.Добавить(ТекРецензент.Пользователь);		
		КонецЦикла; 
		
		МассивРецензентов = ОткрытьФормуМодально("Документ.Д_СлужебнаяЗаписка.Форма.ФормаРецензенты", Новый Структура("Рецензенты", МассивСтарыхРецензентов));
		Если НЕ МассивРецензентов = Неопределено Тогда
			Объект.Рецензенты.Очистить();
			Для каждого ТекРецензент Из МассивРецензентов Цикл
				НоваяСтрока = Объект.Рецензенты.Добавить();
				НоваяСтрока.Пользователь = ТекРецензент;			
			КонецЦикла;
			СформироватьКому();
		КонецЕсли;
	ИначеЕсли Объект.Кому = Неопределено Тогда
		Объект.Кому = ПользовательПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомуОчистка(Элемент, СтандартнаяОбработка)
	Объект.Рецензенты.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	Элементы.ВидимостьВсем.Подсказка = "Документ будет отражаться в списке у всех пользователей, которым доступно предприятие <" + Строка(Объект.Предприятие) + ">.";
	//Элементы.ВидимостьВсем.Заголовок = "Доступен пользователям предприятиия: " + Строка(Объект.Предприятие);
	
	СтруктураДанных = БюджетныйНаСервере.ВернутьРеквизиты(Объект.Предприятие, "УчетПоПодразделениям, ВидДеятельности", Ложь);
	
	Если НЕ СтруктураДанных = Неопределено Тогда
		Элементы.Подразделение.Видимость = СтруктураДанных.УчетПоПодразделениям;
		Если НЕ Элемент = Неопределено Тогда 
			Объект.Подразделение = СтруктураДанных.ВидДеятельности
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СписокВыбора_Предприятие.Количество() Тогда
		ТекЗначение = ВыбратьИзСписка(СписокВыбора_Предприятие, Элемент, СписокВыбора_Предприятие.НайтиПоЗначению(Объект.Предприятие));	
		БюджетныйНаКлиенте.ПриНачалеВыбораРеквизитаВСпискеДубль2(ЭтаФорма, "СписокВыбора_Предприятие", ТекЗначение, "Предприятия", Объект.Предприятие, СтандартнаяОбработка, Ложь);
		ПредприятиеПриИзменении(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьФорму" Тогда
		//ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	ИначеЕсли ИмяСобытия = "УстановитьДоступность" Тогда
		Объект.ТекущийБизнесПроцесс = Параметр.ТекущийБизнесПроцесс;
		Записать();
	ИначеЕсли ИмяСобытия = "Пересчитать" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "ПрикрепленныеФайлы" Тогда	
		сабОбщегоНазначенияКлиент.ОбновитьКоличествоПрикрепленныхФайлов(ЭтаФорма);
	ИначеЕсли ИмяСобытия = "РазрешитьРедактированиеФормы" Тогда	
		ПриОткрытии(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	сабОбщегоНазначенияКлиент.ПослеЗаписиАвтосохраняемойФормы(ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПользовательПустаяСсылка()
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура АвтосохранениеРеквизитовФормыНаКлиенте()
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.Текстовка = Элементы.Текстовка.ТекстРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.УсловияОплаты = Элементы.УсловияОплаты.ТекстРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.НаименованиеДоговора = Элементы.НаименованиеДоговора.ТекстРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.Комментарий = Элементы.Комментарий.ТекстРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.НомерДоговора = Элементы.НомерДоговора.ТекстРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	
	АвтосохранениеРеквизитовФормыНаСервере();		
	
КонецПроцедуры

&НаСервере 
Процедура АвтосохранениеРеквизитовФормыНаСервере()
	
	сабОбщегоНазначения.АвтосохранениеРеквизитовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СписокВыбора_Подразаделение.Количество() Тогда
		ТекЗначение = ВыбратьИзСписка(СписокВыбора_Подразаделение. Элемент, СписокВыбора_Подразаделение.НайтиПоЗначению(Объект.Подразделение));	
		БюджетныйНаКлиенте.ПриНачалеВыбораРеквизитаВСпискеДубль2(ЭтаФорма, "СписокВыбора_Подразаделение", ТекЗначение, "ВидыДеятельности", Объект.Подразделение, СтандартнаяОбработка, Ложь);
	КонецЕсли;

КонецПроцедуры

////////////////////конец общих процедур и функций

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
Функция ПолучитьДанныеКонтрагентПриИзменении(Контрагент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("НаименованиеПолное", Контрагент.НаименованиеПолное);
	СтруктураДанные.Вставить("СчетКонтрагента", Контрагент.ОсновнойБанковскийСчет);
	СтруктураДанные.Вставить("ИННПолучателя", Контрагент.ИНН);
	СтруктураДанные.Вставить("КПППолучателя", Контрагент.КПП);
	СтруктураДанные.Вставить("НазначениеПлатежа", Контрагент.ОсновнойБанковскийСчет.ТекстНазначения);
	СтруктураДанные.Вставить("ТекстКорреспондента", Контрагент.ОсновнойБанковскийСчет.ТекстКорреспондента);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()


&НаКлиенте
Процедура ЗаявкаКонтрагентПриИзменении(Элемент)
	СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Элементы.Заявка.ТекущиеДанные.Контрагент);
	
	Элементы.Заявка.ТекущиеДанные.СчетКонтрагента = СтруктураДанные.СчетКонтрагента;
КонецПроцедуры

&НаКлиенте
Процедура АдресатыПользовательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БюджетныйНаКлиенте.ДобавитьГруппуПользователей(Элементы, ВыбранноеЗначение, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФормумодально("Справочник.Пользователи.ФормаВыбора", Новый Структура("РежимВыбора, РасширенныйПодбор, ЗакрыватьПриВыборе", Истина, Истина, Ложь),Элементы.Адресаты); 
КонецПроцедуры

&НаКлиенте
Процедура ОтслеживатьЗаявку(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед тем как отслеживать заявку её нужно записать!";
		Сообщение.Сообщить();
	Иначе	
		ОтслеживатьСЗ = НЕ Элементы.ОтслеживатьЗаявку.Пометка;
		БПСервер.ОтслеживатьЗаявкуНаСервере(ОтслеживатьСЗ, Объект.Ссылка);
		Элементы.ОтслеживатьЗаявку.Пометка = ОтслеживатьСЗ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамещенныеПриказыПриказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Форма = ПолучитьФорму("Документ.Д_СлужебнаяЗаписка.ФормаВыбора", , Элемент);
	//ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидСЗ");	
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.Приказ");
	//Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлятьНаУтверждениеПриИзменении(Элемент)
	Если НаправлятьНаУтверждение = "Всем сразу" Тогда
		Объект.ОтправлятьВсем = Истина;
	Иначе
		Объект.ОтправлятьВсем = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольнаяСЗПриИзменении(Элемент)
	
	Объект.ВидМероприятия = "";
	
	УстановитьВидимость();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	//ЭтоДопСоглашение = Объект.ВидСЗ = ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.ЗаявкаНаСогласованиеДопСоглашения");
	ЭтоДопСоглашение = Ложь;
	Элементы.Договор.Видимость = ЭтоДопСоглашение;
	Элементы.УсловияОплаты.Видимость = НЕ ЭтоДопСоглашение;
	Элементы.Контрагент.Видимость = НЕ ЭтоДопСоглашение;
	Элементы.Контрагент1.Видимость = ЭтоДопСоглашение;
	Элементы.Текстовка.Заголовок = ?(ЭтоДопСоглашение, "Что изменилось", "Предмет договора");
	Элементы.Группа23.Заголовок = ?(ЭтоДопСоглашение, "Реквизиты доп. соглашения", "Реквизиты договора");
	Если ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Количество() Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы[0].Видимость = НЕ ЭтоДопСоглашение;
	КонецЕсли;
	Если ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Количество() > 1 Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы[1].Видимость = ЭтоДопСоглашение;
	КонецЕсли;
	
	//Заголовок = Строка(Объект.ВидСЗ) + ?(ЗначениеЗаполнено(Объект.Ссылка), Строка(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"), "");
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПериодПриИзмененииНаСервере();
	
	ПолучитьНаименованиеДоговора();
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()

	Объект.ДатаДоговора = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНаименованиеДоговора()
	
	Объект.НаименованиеДоговора = ?(ЗначениеЗаполнено(Объект.ВидМероприятия), Объект.ВидМероприятия + "/", "") + Формат(Объект.ДатаДоговора, "ДФ=dd.MM.yy") + "/" + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yy"); 
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы И Не РежимВосстановления Тогда
		сабОбщегоНазначения.ОчиститьАвтосохраненияОбъекта(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДоговораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокЗн = Новый СписокЗначений;
	СписокЗн.Добавить("Договор аренды");
	СписокЗн.Добавить("Договор займа");
	СписокЗн.Добавить("Договор купли-продажи");
	СписокЗн.Добавить("Договор о полной материальной ответственности");
	СписокЗн.Добавить("Договор поставки");
	СписокЗн.Добавить("Договор услуг");
	СписокЗн.Добавить("Договор перевозки");
	СписокЗн.Добавить("Договор подряда");
	СписокЗн.Добавить("Договор финансовой аренды(лизинга)");
	СписокЗн.Добавить("Договор страхования");
	СписокЗн.Добавить("Договор хранения");
		
	ВыбранноеЗначение = Неопределено;

		
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("НаименованиеДоговораНачалоВыбораЗавершение", ЭтаФорма), СписокЗн, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДоговораНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = ВыбранныйЭлемент;
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Объект.НаименованиеДоговора = ВыбранноеЗначение.Значение;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	СтруктураРекв = БюджетныйНаСервере.ВернутьРеквизиты(Объект.Договор, "Подразделение, стр_ЦФО, Предприятие, Организация", Ложь);
	Объект.ЮрЛицоКомпании = СтруктураРекв.Организация;
	Объект.стрЦФО = СтруктураРекв.стр_ЦФО;
	Объект.Подразделение = СтруктураРекв.Подразделение;
	//ЗаполнитьЗначенияСвойств(Объект, СтруктураРекв);
	//ПредприятиеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВидСЗПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеОригиналыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.ПрикрепленныеОбъекты.ФормаСписка", Новый Структура("Владелец", ДоговорПодчиненный)); 
КонецПроцедуры
	
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	//НовыйМассив = Новый Массив();
	//
	//Если НЕ сабОбщегоНазначенияПовтИсп.МассивДоговоровСПокупателем().Найти(Объект.ВидДоговора) = Неопределено Тогда
	//	НовыйПараметр = Новый ПараметрВыбора("Отбор.Доход", Истина);
	//	НовыйМассив.Добавить(НовыйПараметр);
	//ИначеЕсли НЕ сабОбщегоНазначенияПовтИсп.МассивДоговоровСПоставщиком().Найти(Объект.ВидДоговора) = Неопределено Тогда
	//	НовыйПараметр = Новый ПараметрВыбора("Отбор.Доход", Ложь);
	//	НовыйМассив.Добавить(НовыйПараметр);
	//КонецЕсли;
	//
	//Если ЕстьСтатьиДляДоговоров Тогда
	//	НовыйПараметр = Новый ПараметрВыбора("Отбор.ИспользуетсяВДоговорах", Истина);
	//	НовыйМассив.Добавить(НовыйПараметр);
	//КонецЕсли;
	//
	//НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	//Элементы.СтатьяДДС.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Закрыть();
КонецПроцедуры

#Область РаботаСУниверсальнойФормойЗадачи

&НаСервереБезКонтекста
Процедура ПоказатьВопросыПоОбъекту(Задача, ТекЗаголовокВопросов)
	ТекЗаголовокВопросов = "";
	КоличВопросов = 0;
	Если НЕ ЗначениеЗаполнено(Задача.Заявка) Тогда
		Возврат;	
	КонецЕсли;
	БПСервер.ВывестиВопросыПоДокументу(Неопределено, Задача.Заявка, Истина, КоличВопросов);
	Если КоличВопросов Тогда
		ТекЗаголовокВопросов = Строка(КоличВопросов);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьЗаметкиПоОбъекту(Задача, ТекЗаголовокВопросов)
	ТекЗаголовокВопросов = "";
	КоличВопросов = 0;
	БПСервер.ВывестиЗаметкиПоДокументу(Неопределено, ?(ЗначениеЗаполнено(Задача.Заявка), Задача.Заявка, Задача), Истина, КоличВопросов);
	Если КоличВопросов Тогда
		ТекЗаголовокВопросов = Строка(КоличВопросов);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПоказатьОбсуждениеОбъекта(Задача, ТекЗаголовокОбсуждений)
	ТекЗаголовокОбсуждений = "";
	КоличОбсуждений = 0;
	
	Если НЕ ЗначениеЗаполнено(Задача.Заявка) Тогда
		Возврат;	
	КонецЕсли;
	
	БПСервер.ВывестиОбсужденияПоДокументу(Неопределено, Задача.Заявка, Истина, КоличОбсуждений);
	Если КоличОбсуждений Тогда
		ТекЗаголовокОбсуждений = Строка(КоличОбсуждений);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьРанееПройденныеПользователем(Задача, РанееВыполненныеЗадачи, ТекПользователь = Неопределено)
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	РанееВыполненныеЗадачи = "";
	КоличРанееВыполненных = 0;
	
	Если НЕ ЗначениеЗаполнено(Задача.Заявка) Тогда
		Возврат;	
	КонецЕсли;
	
	БПСервер.ВывестиРанееВыполненныеВамиЗадачиПоДокументу(Неопределено, Задача.Заявка, Истина, КоличРанееВыполненных, РанееВыполненныеЗадачи, ТекПользователь);
	Если ЗначениеЗаполнено(РанееВыполненныеЗадачи) Тогда
		РанееВыполненныеЗадачи = "Вы уже согласовывали этот документ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаВопросыПоДокументуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(БюджетныйНаСервере.ВернутьРеквизиты(ЭтаФорма.Задача, "Заявка").Заявка, "ОбщаяПечатьВопросовПоДокументу");
КонецПроцедуры

&НаКлиенте
Процедура ОбсуждениеДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(БюджетныйНаСервере.ВернутьРеквизиты(ЭтаФорма.Задача, "Заявка").Заявка, "ОбщаяПечатьОбсужденийПоДокументу");
КонецПроцедуры

&НаКлиенте
Процедура РанееВыполненныеЗадачиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(БюджетныйНаСервере.ВернутьРеквизиты(ЭтаФорма.Задача, "Заявка").Заявка, "Справочник.СогласованиеОбщее.Команда.ОтчетПоВыполнению");
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Владелец", БюджетныйНаСервере.ВернутьРеквизиты(ЭтаФорма.Задача, "Заявка").Заявка);
	ТекФорма = ПолучитьФорму("РегистрСведений.ПрикрепленныеОбъекты.ФормаСписка", ПараметрыФормы, , Истина);
	ТекФорма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ТекКоманда1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//Если Элементы.ТекЗадачи.ВыделенныеСтроки.Количество() > 1 Тогда
	//	
	//	НужныПодтвержденияКнопок = БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "ДопПодтверждениеНажатияКнопок");
	//	Если НужныПодтвержденияКнопок Тогда
	//		СтруктураВопростов = БПСервер.ПолучитьТекстыВопросов(Задача, 1);
	//		ПоказатьВопрос(Новый ОписаниеОповещения("СогласоватьБизнесПроцессЗавершениеБезВопросов", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", Элементы.ТекЗадачи.ВыделенныеСтроки)), СтруктураВопростов.Вопрос, РежимДиалогаВопрос.ДаНет);
	//	Иначе
	//		СогласоватьБизнесПроцессЗавершениеБезВопросов(КодВозвратаДиалога.Да, Новый Структура("ВыделенныеСтроки", Элементы.ТекЗадачи.ВыделенныеСтроки)); 	
	//	КонецЕсли;
	//	
	//Иначе
		НужныПодтвержденияКнопок = БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "ДопПодтверждениеНажатияКнопок");
		Если НужныПодтвержденияКнопок Тогда
			СтруктураВопростов = БПСервер.ПолучитьТекстыВопросов(ЭтаФорма.Задача, 1);
			ПоказатьВопрос(Новый ОписаниеОповещения("СогласоватьБизнесПроцессЗавершение", ЭтотОбъект, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)), СтруктураВопростов.Вопрос, РежимДиалогаВопрос.ДаНет);
		Иначе
			СогласоватьБизнесПроцессЗавершение(КодВозвратаДиалога.Да, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)); 	
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьБизнесПроцессЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекДанные = БюджетныйНаСервере.ВернутьРеквизиты(ЭтаФорма.Задача, "СрокВыполнения");
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ИЛИ НЕ ДополнительныеПараметры.НужныПодтвержденияКнопок Тогда
		Если ЭтаФорма.ЗадачаТекИмяКоманды1 = "ПринятьОбращение" Тогда
			Если Не ЗначениеЗаполнено(ТекДанные.СрокВыполнения) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Введите примерный срок окончания работ";
				Сообщение.Поле = "СрокОкончания";
				//Сообщение.УстановитьДанные();
				Сообщение.Сообщить(); 
				Возврат;
			ИначеЕсли ТекДанные.СрокВыполнения < ТекущаяДата() Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Срок окончания работ не может быть мешьше текущей даты";
				Сообщение.Поле = "СрокОкончания";
				//Сообщение.УстановитьДанные();
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//проверка в случае точки исполнения
		НуженВозврат = Ложь;
		ТекстПредупреждения = "";
		БюджетныйНаКлиенте.ПроверкаИсполнения(ЭтаФорма.Задача, ЭтаФорма.ПодчиненныеДокументы, НуженВозврат, ТекстПредупреждения);
		Если НуженВозврат = Неопределено Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаИсполненияЗавершение", ЭтотОбъект, ), ТекстПредупреждения + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет);
		ИначеЕсли НуженВозврат = Истина Тогда	
			Возврат;		
		КонецЕсли;
		
		//проверка на исполнителя маршрута
		БПСервер.ПроверитьИсполнителейЗаявки(ЭтаФорма.Задача, ТекстПредупреждения, НуженВозврат);
		Если НуженВозврат = Истина Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СогласоватьБизнесПроцессЗавершениеЗавершение", ЭтотОбъект), ТекстПредупреждения, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
		Если Не БПСервер.ПроверкаЗадачи(ЭтаФорма.Задача) И НуженВозврат = Ложь Тогда
			Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
			БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды1, ПолучитьСтруктуруРеквизитовФормы(), Ложь, "ФормаУниверсальная");
			ОповеститьОбИзменении(ЭтаФорма.Задача);
			Оповестить("ОбновитьСписокЗадач");
			Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
			Закрыть();
		КонецЕсли;
		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьБизнесПроцессЗавершениеЗавершение(РезультатВопроса1, ДополнительныеПараметры1) Экспорт
	
	Если РезультатВопроса1 = КодВозвратаДиалога.Да  Тогда
		Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
		ПересчитатьМаршрутНаСервере(ЭтаФорма.Задача);
		Если Не БПСервер.ПроверкаЗадачи(ЭтаФорма.Задача) Тогда
			БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды1, ПолучитьСтруктуруРеквизитовФормы(), Ложь, "ФормаУниверсальная");
			ОповеститьОбИзменении(ЭтаФорма.Задача);
			Оповестить("ОбновитьСписокЗадач");
			Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьМаршрутНаСервере(Задача)
	Если ТипЗнч(Задача.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") Тогда
		ТекБПОб = Задача.БизнесПроцесс.ПолучитьОбъект();
		ТекБПОб.ДопИсполнение.Очистить();
		БизнесПроцессы.Согласование1.ДобавитьСтрокуДопИсполнение(ТекБПОб, Задача.Заявка);
		БПСервер.ДобавитьРецензентовВМаршрут(ТекБПОб, "ДопИсполнение", Задача.Заявка);	
		ТекБПОб.Записать();
	ИначеЕсли ТипЗнч(Задача.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаАвансовыйОтчет") Тогда
		ТекБПОб = Задача.БизнесПроцесс.ПолучитьОбъект();
		ТекБПОб.ДопИсполнение.Очистить();
		ТекБПОб.ЗаполнитьНаСервереАвансовыйОтчет(ТекБПОб, Задача.Заявка, Истина);	
		ТекБПОб.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИсполненияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
		БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды1, ПолучитьСтруктуруРеквизитовФормы(), Ложь, "ФормаУниверсальная");
		ОповеститьОбИзменении(ЭтаФорма.Задача);
		Оповестить("ОбновитьСписокЗадач");
		Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИсполненияЗавершение2(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
		БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды2, ПолучитьСтруктуруРеквизитовФормы(), Ложь, "ФормаУниверсальная");
		ОповеститьОбИзменении(ЭтаФорма.Задача);
		Оповестить("ОбновитьСписокЗадач");
		Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИсполненияДоработкаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
		БПСервер.УдалитьПППоЗаявке(ЭтаФорма.Задача);
		
		БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды3, ПолучитьСтруктуруРеквизитовФормы(), Ложь,"ФормаУниверсальная");
		ОповеститьОбИзменении(ЭтаФорма.Задача);
		Оповестить("ОбновитьСписокЗадач");
		Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДалее(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.КонвертироватьВПДФ.Заголовок = "Конвертировать в pdf" Тогда
		Если ЗначениеЗаполнено(Объект.РольИсполнителя) И ТипЗнч(Объект.РольИсполнителя) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			Если Элементы.КонвертироватьВПДФ.Доступность = Истина Тогда
				ПоказатьПредупреждение(,"Имеются прикрепленные документы формата doc/docx/rtf. Перед согласованием необходимо конвертировать файлы в формат ""pdf"". Для этого нажмите команду ""Конвертировать в pdf"" на форме.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НужныПодтвержденияКнопок = БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "ДопПодтверждениеНажатияКнопок");
	СтруктураВопростов = БПСервер.ПолучитьТекстыВопросов(Объект.Ссылка, 3);
	Если НужныПодтвержденияКнопок Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СогласоватьБизнесПроцессЗавершение3", ЭтотОбъект, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)), СтруктураВопростов.Вопрос, РежимДиалогаВопрос.ДаНет);
	Иначе
		СогласоватьБизнесПроцессЗавершение3(КодВозвратаДиалога.Да, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)); 	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьБизнесПроцессЗавершение3(РезультатВопроса, ДополнительныеПараметры) Экспорт
	ТекДанные = Объект;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ИЛИ НЕ ДополнительныеПараметры.НужныПодтвержденияКнопок Тогда
		
		Если ПустаяСтрока(ЭтаФорма.ЗадачаКомментарий) И НЕ ДополнительныеПараметры.СтруктураВопростов.СообщениеОбОшибке = "" Тогда
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана причина возврата на доработку", ,"Комментарий", ,Истина);
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
			ЭтаФорма,
			ДополнительныеПараметры.СтруктураВопростов.СообщениеОбОшибке,
			,
			,
			"ЗадачаКомментарий",
			);
			Возврат;
		КонецЕсли;
		
		
		//проверка в случае точки исполнения
		НуженВозврат = Ложь;
		ТекстПредупреждения = "";
		БюджетныйНаКлиенте.ПроверкаИсполнения(Объект.Ссылка, ЭтаФорма.ПодчиненныеДокументы, НуженВозврат, ТекстПредупреждения);
		Если НуженВозврат = Неопределено Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаИсполненияЗавершение2", ЭтотОбъект, ), ТекстПредупреждения + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет);
		ИначеЕсли НуженВозврат = Истина Тогда	
			Возврат;		
		КонецЕсли;
		
		Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) И НуженВозврат = Ложь Тогда
			Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
			//ДобавитьКомментарий(Неопределено);
			//ДопКомментарий = "";
			СтруктураРеквизитовФормы = ПолучитьСтруктуруРеквизитовФормы();
			//СтруктураРеквизитовФормы.Вставить("ДопКомментарийОтправитьДалее", ДопКомментарий);
			
			БПСервер.ВыполнитьКомандуЗадачиБП(Объект.Ссылка, ЭтаФорма.ЗадачаТекИмяКоманды2, СтруктураРеквизитовФормы, Ложь, "ФормаУниверсальная");
			ОповеститьОбИзменении(Объект.Ссылка);
			Оповестить("ОбновитьСписокЗадач");
			Закрыть();
		КонецЕсли;
		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекКоманда2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НужныПодтвержденияКнопок = БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "ДопПодтверждениеНажатияКнопок");
	СтруктураВопростов = БПСервер.ПолучитьТекстыВопросов(ЭтаФорма.Задача, 2);
	Если НужныПодтвержденияКнопок Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СогласоватьБизнесПроцессЗавершение2", ЭтотОбъект, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)), СтруктураВопростов.Вопрос, РежимДиалогаВопрос.ДаНет);
	Иначе
		СогласоватьБизнесПроцессЗавершение2(КодВозвратаДиалога.Да, Новый Структура("НужныПодтвержденияКнопок, СтруктураВопростов", НужныПодтвержденияКнопок, СтруктураВопростов)); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьБизнесПроцессЗавершение2(РезультатВопроса, ДополнительныеПараметры) Экспорт
	ТекДанные = ЭтаФорма.Задача;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да ИЛИ НЕ ДополнительныеПараметры.НужныПодтвержденияКнопок Тогда
		//ТекДанные = Элементы.ТекЗадачи.ТекущиеДанные;
		Если ПустаяСтрока(ЭтаФорма.ЗадачаКомментарий) И НЕ ДополнительныеПараметры.СтруктураВопростов.СообщениеОбОшибке = "" Тогда
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана причина возврата на доработку", ,"Комментарий", ,Истина);
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
			ЭтаФорма,
			ДополнительныеПараметры.СтруктураВопростов.СообщениеОбОшибке,
			,
			,
			"ЗадачаКомментарий",
			);
			Возврат;
		КонецЕсли;
		
		//проверка в случае точки исполнения
		НуженВозврат = Ложь;
		ТекстПредупреждения = "";
		БюджетныйНаКлиенте.ПроверкаИсполненияДоработка(ЭтаФорма.Задача, ЭтаФорма.ПодчиненныеДокументы, НуженВозврат, ТекстПредупреждения);
		Если НуженВозврат = Неопределено Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаИсполненияДоработкаЗавершение", ЭтотОбъект, ), ТекстПредупреждения + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет);
		ИначеЕсли НуженВозврат = Истина Тогда	
			Возврат;		
		КонецЕсли;
		
		Если Не БПСервер.ПроверкаЗадачи(ЭтаФорма.Задача) И НуженВозврат = Ложь Тогда
			Записать(?(Объект.Проведен, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение), Неопределено));
			БПСервер.ВыполнитьКомандуЗадачиБП(ЭтаФорма.Задача, ЭтаФорма.ЗадачаТекИмяКоманды3, ПолучитьСтруктуруРеквизитовФормы(), Ложь,"ФормаУниверсальная");
			ОповеститьОбИзменении(ЭтаФорма.Задача);
			Оповестить("ОбновитьСписокЗадач");
			Оповестить("ЗакрытьЗадачу", ЭтаФорма.Задача);
			Закрыть();
		КонецЕсли;
		
		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруРеквизитовФормы()
	ТекСтруктураРеквизитов = БПСервер.ПолучитьСтруктуруРеквизитовФормы(ЭтаФорма);
	
	//добавляем ТЧ бизнеспроцессов
	//БизнесПроцесс = Задача.БизнесПроцесс;
	//Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
	//	Для каждого ТЧ Из Метаданные.БизнесПроцессы[БизнесПроцесс.Метаданные().Имя].ТабличныеЧасти Цикл
	//		ТекСтруктураРеквизитов.Вставить(ТЧ.Имя, БизнесПроцесс[ТЧ.Имя].Выгрузить());			
	//	КонецЦикла; 
	//КонецЕсли;
	
	
	Возврат  ТекСтруктураРеквизитов;
КонецФункции

#КонецОбласти
